Revit 2024 API
IFCGuidKey.IFCGlobalId Property
 IFC GlobalId for map.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public string IFCGlobalId { get; }
Visual Basic
Public ReadOnly Property IFCGlobalId As String
	Get
Visual C++
public:
property String^ IFCGlobalId {
	String^ get ();
}
See Also
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace